import java.util.Scanner;

public class Tetromino {
	static int n;
	static int m;
	static int[][] map = new int[503][503];
	final static int[][][] block = {{
				{ 1,1,1,1, },
				{ 0,0,0,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,0,0,0, },
				{ 1,0,0,0, },
				{ 1,0,0,0, },
				{ 1,0,0,0, }
			},{
				{ 1,1,0,0, },
				{ 1,1,0,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,0,0,0, },
				{ 1,0,0,0, },
				{ 1,1,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,1,1,0, },
				{ 1,0,0,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,1,0,0, },
				{ 0,1,0,0, },
				{ 0,1,0,0, },
				{ 0,0,0,0, }
			},{
				{ 0,0,1,0, },
				{ 1,1,1,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 0,1,0,0, },
				{ 0,1,0,0, },
				{ 1,1,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,0,0,0, },
				{ 1,1,1,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,1,0,0, },
				{ 1,0,0,0, },
				{ 1,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,1,1,0, },
				{ 0,0,1,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,0,0,0, },
				{ 1,1,0,0, },
				{ 0,1,0,0, },
				{ 0,0,0,0, }
			},{
				{ 0,1,1,0, },
				{ 1,1,0,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 0,1,0,0, },
				{ 1,1,0,0, },
				{ 1,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,1,0,0, },
				{ 0,1,1,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,1,1,0, },
				{ 0,1,0,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 0,1,0,0, },
				{ 1,1,0,0, },
				{ 0,1,0,0, },
				{ 0,0,0,0, }
			},{
				{ 0,1,0,0, },
				{ 1,1,1,0, },
				{ 0,0,0,0, },
				{ 0,0,0,0, }
			},{
				{ 1,0,0,0, },
				{ 1,1,0,0, },
				{ 1,0,0,0, },
				{ 0,0,0,0, }
			}
	};		
	
	private static int get_count(int sy, int sx, int k) {
		int ret = 0;
		for (int y = 0; y < 4; ++y)	{// 보드값에서 블럭사이즈 만큼 순회
			for (int x = 0; x < 4; ++x)	{
				ret += (block[k][y][x]) * map[sy + y][sx + x]; // 블럭 * 보드값으로 16개의 좌표 값을 모두 더함
			}
		}
		return ret;
	}


	public static void main(String[] args) {
		
		Scanner scan = new Scanner(System.in); // 이제야 이건 익숙해져가네

		n = scan.nextInt(); // 보드의 사이즈
		m = scan.nextInt();
		
		for (int y = 0; y < n; ++y)
		{
			for (int x = 0; x < m; ++x)
			{
				map[y][x] = scan.nextInt(); // 보드를 채움
			}
		}

		for (int y = n; y < n + 3; ++y)	{
			for (int x = 0; x < m + 3; ++x)	{
				map[y][x] = -5000; // 보드의 아래 3줄을 음의 무한대로 채움
			}
		}

		for (int y = 0; y < n + 3; ++y) {
			for (int x = m; x < m + 3; ++x) {
				map[y][x] = -5000; // 보드의 옆 3줄을 음의 무한대를 채움
			}
		}

		int ret = 0;
		for (int y = 0; y < n; ++y) { //보드 순회
			for (int x = 0; x < m; ++x) {
				for (int k = 0; k < 19; ++k) { // 블럭 대입
					int candi = get_count(y, x, k); 
					if (ret < candi) {
						ret = candi;
					}
				}
			}
		}
		System.out.printf("%d\n", ret);
	}

}
